import { Context } from "./components/timeline/types";

export const periods: Context["periods"] = [
  {
    key: "1",
    period: ["2015", "2022"],
    title: "Наука",
    events: [
      {
        key: "1",
        title: "2015",
        content:
          "13 сентября — частное солнечное затмение, видимое в Южной Африке и части Антарктиды",
      },
      {
        key: "2",
        title: "2016",
        content:
          "Телескоп «Хаббл» обнаружил самую удалённую из всех обнаруженных галактик, получившую обозначение GN-z11",
      },
      {
        key: "3",
        title: "2017",
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
      {
        key: "4",
        title: "2018",
        content:
          "Компания Tesla официально представила первый в мире электрический грузовик Tesla Semi",
      },
    ],
  },
  {
    key: "2",
    period: ["2010", "2018"],
    title: "Технологии",
    events: [
      {
        key: "1",
        title: "2010",
        content:
          "Запуск первого iPad от Apple, который стал революционным устройством для планшетов",
      },
      {
        key: "2",
        title: "2012",
        content:
          "NASA успешно посадило марсоход Curiosity на поверхность Марса",
      },
      {
        key: "3",
        title: "2014",
        content: "Компания Google представила первые умные очки Google Glass",
      },
      {
        key: "4",
        title: "2016",
        content:
          "Запуск первого многоразового ракетоносителя Falcon 9 от SpaceX",
      },
    ],
  },
  {
    key: "3",
    period: ["2000", "2010"],
    title: "Космос",
    events: [
      {
        key: "1",
        title: "2000",
        content:
          "Первые постоянные экипажи начали жить на Международной космической станции (МКС)",
      },
      {
        key: "2",
        title: "2003",
        content:
          "Катастрофа шаттла «Колумбия», которая привела к гибели всех семи членов экипажа",
      },
      {
        key: "3",
        title: "2006",
        content: "Плутон переклассифицирован как карликовая планета",
      },
      {
        key: "4",
        title: "2009",
        content: "Запуск космического телескопа «Кеплер» для поиска экзопланет",
      },
    ],
  },
  {
    key: "4",
    period: ["1990", "2000"],
    title: "История",
    events: [
      {
        key: "1",
        title: "1991",
        content: "Распад Советского Союза и окончание холодной войны",
      },
      {
        key: "2",
        title: "1994",
        content: "Первый полёт многоразового космического аппарата «Буран»",
      },
      {
        key: "3",
        title: "1997",
        content: "Великобритания передала Гонконг Китаю",
      },
      {
        key: "4",
        title: "1999",
        content: "Введение евро как безналичной валюты в 11 странах Европы",
      },
    ],
  },
  {
    key: "5",
    period: ["1980", "1990"],
    title: "Культура",
    events: [
      {
        key: "1",
        title: "1980",
        content: "Олимпийские игры в Москве, бойкотированные рядом стран",
      },
      {
        key: "2",
        title: "1983",
        content: "Выпуск первого мобильного телефона Motorola DynaTAC 8000X",
      },
      {
        key: "3",
        title: "1985",
        content: "Основание компании Nintendo Entertainment System (NES)",
      },
      {
        key: "4",
        title: "1989",
        content:
          "Падение Берлинской стены, символизирующее окончание холодной войны",
      },
    ],
  },
  {
    key: "6",
    period: ["1970", "1980"],
    title: "Искусство",
    events: [
      {
        key: "1",
        title: "1970",
        content:
          "Первый выпуск альбома «Bridge Over Troubled Water» от Simon & Garfunkel",
      },
      {
        key: "2",
        title: "1973",
        content:
          "Пикассо завершил свою последнюю работу, ставшую одной из самых известных в его карьере",
      },
      {
        key: "3",
        title: "1977",
        content: "Премьера фильма «Звёздные войны: Эпизод IV — Новая надежда»",
      },
      {
        key: "4",
        title: "1979",
        content:
          "Выпуск первого альбома группы The Clash, ставшего культовым в панк-роке",
      },
    ],
  },
];
